Revit 2017 API
TextEditorOptions Class
 Provides access to settings that control Revit's Text Editor appearance and functionality.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2017
Syntax
C#
public class TextEditorOptions : IDisposable
Visual Basic
Public Class TextEditorOptions _
	Implements IDisposable
Visual C++
public ref class TextEditorOptions : IDisposable
Remarks
 These settings are stored in the Revit.ini file. All documents in Revit instances which use this Revit.ini will follow these settings.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.TextEditorOptions
See Also
TextEditorOptions Members
Autodesk.Revit.UI Namespace